subsetting
.iloc[:, ], .loc[:, ], .columnname, []

reorder
.iloc[:, ], .loc[:, ], []

rename
.rename( columns = {}, inplace = )

add new columns
.assign()
.loc[:, ] = 
[] =

drop the columns
.drop( columns = [], inplace = )

data type: not discussed

filters
manual: .head(), .tail(), [] - use as slicers, .loc[], .iloc[]
conditional: [], .loc[]

bitwise operators: & | ~

sorting
.sort_values( by = [], ascending = [], inplace = , ignore_index = , kind = , na_position = )
.sort_index( axis = , ascending = [], inplace = , ignore_index =  )

duplicates
.drop_duplicates( subset = [], keep = , inplace = , ignore_index = )
.duplicated( subset = [], keep = )

### Topics for today!!

outliers : that should be looked into in a Series
    EDA - outlier detection
        boxplot | IQR
        quantile | Percentiles
        STD
        
    Data Prep - outlier treatment
        .clip( lower = , upper = , inplace = )
        
        Not available in latest version of pandas
        .clip_lower()
        .clip_upper()

missings
    EDA - .isna(), .isnull(), .notna(), .notnull(), .count(), %age of missings
    
    Treatment:
    Drop the rows : .dropna( axis = 0 )
    Drop the columns : .dropna( axis = 1 )
    Missing value imputation
        1. static data
        2. central tendencies : mean, median, mode
        3. predicted values

Summaries of the data
    .groupby() | aggregate functions
    .pivot_table()
    
    pd.crosstab()

#### outliers

IQR (Inter Quartile Range) method:  boxplot and wiskers
    --------------------------------------------------

5 point summary
min, q1, q2, q3, max

iqr = q3 - q1    or
iqr = p75 - p25

lc = q1 - 1.5 * iqr
uc = q3 + 1.5 * iqr



Percentile method
    ---------------------------------------------------

lc = p1
uc = p99



Std Dev. Method
    ---------------------------------------------------
    
lc = mean - 2.5 * std.
uc = mean + 2.5 * std.

lc = mean - 3 * std.
uc = mean + 3 * std.

In [1]:
import pandas as pd

In [3]:
stores = pd.read_csv('D:/SampleData/stores.csv')

In [6]:
print(stores.TotalSales.min(), stores.TotalSales.max())

71.1 472.0

In [13]:
stores.columns

Index(['StoreCode', 'StoreName', 'StoreType', 'Location', 'OperatingCost',
       'Staff_Cnt', 'TotalSales', 'Total_Customers', 'AcqCostPercust',
       'BasketSize', 'ProfitPercust', 'OwnStore', 'OnlinePresence', 'Tenure',
       'StoreSegment'],
      dtype='object')

In [9]:
# Method 1: Percentile
lc = stores.TotalSales.quantile(0.01)
uc = stores.TotalSales.quantile(0.99)

print(lc, uc)

stores.TotalSales.clip( lower = lc, upper = uc )

72.526 468.28000000000003

0     160.000
1     160.000
2     108.000
3     258.000
4     360.000
5     225.000
6     360.000
7     146.700
8     140.800
9     167.600
10    167.600
11    275.800
12    275.800
13    275.800
14    468.280
15    460.000
16    440.000
17     78.700
18     75.700
19     72.526
20    120.100
21    318.000
22    304.000
23    350.000
24    400.000
25     79.000
26    120.300
27     95.100
28    351.000
29    145.000
30    301.000
31    121.000
Name: TotalSales, dtype: float64

In [15]:
# Method 2: IQR
q1 = stores.Total_Customers.quantile(0.25)
q3 = stores.Total_Customers.quantile(0.75)
iqr = q3 - q1

lc = q1 - 1.5 * iqr
uc = q3 + 1.5 * iqr

print(stores.Total_Customers.min(), stores.Total_Customers.max())
print(lc, uc)

stores.Total_Customers.clip( lower = lc, upper = uc )

52 335
-28.75 305.25

0     110.00
1     110.00
2      93.00
3     110.00
4     175.00
5     105.00
6     245.00
7      62.00
8      95.00
9     123.00
10    123.00
11    180.00
12    180.00
13    180.00
14    205.00
15    215.00
16    230.00
17     66.00
18     52.00
19     65.00
20     97.00
21    150.00
22    150.00
23    245.00
24    175.00
25     66.00
26     91.00
27    113.00
28    264.00
29    175.00
30    305.25
31    109.00
Name: Total_Customers, dtype: float64

In [12]:
# Method 3: STD
u = stores.TotalSales.mean()
stddev = stores.TotalSales.std()

lc = u - 2.5 * stddev
uc = u + 2.5 * stddev

print(lc, uc)

stores.TotalSales.clip( lower = lc, upper = uc )

-79.12485957845482 540.5686095784549

0     160.0
1     160.0
2     108.0
3     258.0
4     360.0
5     225.0
6     360.0
7     146.7
8     140.8
9     167.6
10    167.6
11    275.8
12    275.8
13    275.8
14    472.0
15    460.0
16    440.0
17     78.7
18     75.7
19     71.1
20    120.1
21    318.0
22    304.0
23    350.0
24    400.0
25     79.0
26    120.3
27     95.1
28    351.0
29    145.0
30    301.0
31    121.0
Name: TotalSales, dtype: float64

### Missing Values | null | sysmiss | None | NaN or NaT

Identify the missings
.isna(), .isnull(), .notna(), .notnull()
.count()

** Get the %age of missing values in every variable

Missing value treatment
    remove the rows with missings : .dropna( axis = 0 )
    
    remove the column / variable : .dropna( axis = 1 )
    
    missing value imputation: .fillna()
        static
        central tendency : mean, median, mode
        predicive models to predict for the misisng values

In [34]:
stores.isna().sum() / stores.isna().count()

StoreCode          0.00000
StoreName          0.00000
StoreType          0.00000
Location           0.00000
OperatingCost      0.00000
Staff_Cnt          0.00000
TotalSales         0.00000
Total_Customers    0.00000
AcqCostPercust     0.09375
BasketSize         0.00000
ProfitPercust      0.00000
OwnStore           0.00000
OnlinePresence     0.00000
Tenure             0.00000
StoreSegment       0.00000
dtype: float64

In [36]:
stores.isna().sum() / stores.shape[0]

StoreCode          0.00000
StoreName          0.00000
StoreType          0.00000
Location           0.00000
OperatingCost      0.00000
Staff_Cnt          0.00000
TotalSales         0.00000
Total_Customers    0.00000
AcqCostPercust     0.09375
BasketSize         0.00000
ProfitPercust      0.00000
OwnStore           0.00000
OnlinePresence     0.00000
Tenure             0.00000
StoreSegment       0.00000
dtype: float64

In [58]:
import numpy as np

In [59]:
# stores.iloc[0, 4] = np.NaN

In [63]:
stores.dropna( axis = 0, subset = ['OperatingCost'] ).head(2)

,StoreCode,StoreName,StoreType,Location,OperatingCost,Staff_Cnt,TotalSales,Total_Customers,AcqCostPercust,BasketSize,ProfitPercust,OwnStore,OnlinePresence,Tenure,StoreSegment
1,STR102,Apparel Zone,Apparel,Delhi,21.0,60,160.0,110,3.90,2.875,17.02,0,1,4,4
2,STR103,Super Bazar,Super Market,Delhi,22.8,40,108.0,93,3.85,2.320,18.61,1,1,4,1

In [64]:
stores.dropna( axis = 0, subset = ['Location', 'AcqCostPercust'] ).head(2)

,StoreCode,StoreName,StoreType,Location,OperatingCost,Staff_Cnt,TotalSales,Total_Customers,AcqCostPercust,BasketSize,ProfitPercust,OwnStore,OnlinePresence,Tenure,StoreSegment
0,STR101,Electronics Zone,Electronincs,Delhi,NaN,60,160.0,110,3.9,2.620,16.46,0,1,4,4
1,STR102,Apparel Zone,Apparel,Delhi,21.0,60,160.0,110,3.9,2.875,17.02,0,1,4,4

In [ ]:
stores.AcqCostPercust.fillna( 10 ) # static value

stores.AcqCostPercust.fillna( stores.AcqCostPercust.mean() ) # mean value

### Summaries

In [ ]:
.groupby()
.sum(), .mean()...., .agg([]), agg({})
.reset_index( drop = False )
.pivot( index = , columns = , values = )

.pivot_table( index = , columns = , values = , aggfunc = )

pd.crosstab( index = , columns = , values = , aggfunc = )

In [73]:
# get the total sales for each location
stores.groupby( 'Location' )['TotalSales'].sum()

# stores.groupby( 'Location' ).TotalSales.sum()

Location
Chennai    2235.4
Delhi      1777.7
Kolkata    1612.4
Mumbai     1757.6
Name: TotalSales, dtype: float64

In [74]:
# get the total sales and operating cost for each location
stores.groupby( 'Location' )[['TotalSales', 'OperatingCost']].sum()

          TotalSales  OperatingCost
Location
Chennai       2235.4          129.5
Delhi         1777.7          140.7
Kolkata       1612.4          174.8
Mumbai        1757.6          176.9

In [82]:
# get the total and average sales for each location
stores.groupby('Location').TotalSales.agg(['sum', 'mean'])

             sum      mean
Location
Chennai   2235.4  279.4250
Delhi     1777.7  222.2125
Kolkata   1612.4  201.5500
Mumbai    1757.6  219.7000

In [84]:
# get the total Sales and average OperatingCost for each location
stores.groupby('Location')[['TotalSales', 
            'OperatingCost']].agg({'TotalSales': [np.sum, np.mean], 'OperatingCost': np.mean})

         TotalSales           OperatingCost
                sum      mean          mean
Location
Chennai      2235.4  279.4250       16.1875
Delhi        1777.7  222.2125       20.1000
Kolkata      1612.4  201.5500       21.8500
Mumbai       1757.6  219.7000       22.1125

In [92]:
stores.reset_index?

In [99]:
# get the total sales for each Location and StoreType
summ = stores.groupby(['Location','StoreType']).TotalSales.sum().reset_index( drop = False )

In [103]:
summ.pivot( index = 'Location', columns = 'StoreType', values = 'TotalSales' )

StoreType  Apparel  Electronincs  Super Market
Location
Chennai      915.4         600.8         719.2
Delhi        745.0         306.7         726.0
Kolkata      525.0         521.0         566.4
Mumbai       700.7         790.0         266.9

In [104]:
stores.pivot_table( index = 'Location', columns = 'StoreType', values = 'TotalSales', aggfunc = 'sum')

StoreType  Apparel  Electronincs  Super Market
Location
Chennai      915.4         600.8         719.2
Delhi        745.0         306.7         726.0
Kolkata      525.0         521.0         566.4
Mumbai       700.7         790.0         266.9

In [113]:
stores.pivot_table( index = ['Location', 'StoreType'], values = ['TotalSales', 'OperatingCost'], 
                aggfunc = ['sum', 'mean']).reset_index()

   Location     StoreType           sum                     mean
                          OperatingCost TotalSales OperatingCost  TotalSales
0   Chennai       Apparel          44.8      915.4     14.933333  305.133333
1   Chennai  Electronincs          33.2      600.8     16.600000  300.400000
2   Chennai  Super Market          51.5      719.2     17.166667  239.733333
3     Delhi       Apparel          53.4      745.0     17.800000  248.333333
4     Delhi  Electronincs          24.4      306.7     24.400000  153.350000
5     Delhi  Super Market          62.9      726.0     20.966667  242.000000
6   Kolkata       Apparel          62.0      525.0     20.666667  175.000000
7   Kolkata  Electronincs          40.6      521.0     20.300000  260.500000
8   Kolkata  Super Market          72.2      566.4     24.066667  188.800000
9    Mumbai       Apparel          63.1      700.7     21.033333  233.566667
10   Mumbai  Electronincs          28.0      790.0     14.000000  395.000000
11   Mumbai  Super Market          85.8      266.9     28.600000   88.966667

In [110]:
pd.crosstab(index = stores.Location, columns = stores.StoreType, 
            values = stores.TotalSales, aggfunc = 'count' )

StoreType  Apparel  Electronincs  Super Market
Location
Chennai          3             2             3
Delhi            3             2             3
Kolkata          3             2             3
Mumbai           3             2             3

In [114]:
True and False

False

In [118]:
pd.Series([True, False]) & pd.Series([True, True])

0     True
1    False
dtype: bool

In [123]:
# get the total records for each store type
stores.groupby('StoreType').StoreCode.agg('count').reset_index()

      StoreType  StoreCode
0       Apparel         12
1  Electronincs          8
2  Super Market         12

In [122]:
stores.pivot_table( index = 'StoreType', values = 'StoreCode', aggfunc = 'count' ).reset_index()

      StoreType  StoreCode
0       Apparel         12
1  Electronincs          8
2  Super Market         12